<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ea6a80d7aa4bf844c2fcc5f0e4a729164f04fe5662bc5d23c17304a987688cd2","plan_job_ref":"Job Write Terraform Plan to Pull Request #32 at https://github.com/hackforla/devops-security/actions/runs/8091962269","plan_out_hash":"d634ff8da908376cdc53e1c4332991aeba339bc1de9d4936a5eb6065ea15811c","plan_hash":"5210715bfcaff2ff08c28fe057752239d536fc6246f9b287e054a22736775011","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_custom_policies.aws_iam_policy.custom_policy["IAMServicesAdmin"] will be destroyed
  # (because key ["IAMServicesAdmin"] is not in for_each map)
-   resource "aws_iam_policy" "custom_policy" {
-       arn         = "arn:aws:iam::035866691871:policy/IAMServicesAdmin" -> null
-       description = "Policy granting IAM services admins permissions to make changes to user accounts" -> null
-       id          = "arn:aws:iam::035866691871:policy/IAMServicesAdmin" -> null
-       name        = "IAMServicesAdmin" -> null
-       path        = "/" -> null
-       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "iam:CreateAccessKey",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:iam::*:user/*"
                    },
-                   {
-                       Action    = [
-                           "iam:UpdateLoginProfile",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "iam:ResourceTag/Access Level" = [
-                                   "1",
-                                   "2",
                                ]
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:iam::*:user/*"
                    },
-                   {
-                       Action   = [
-                           "cloudshell:CreateEnvironment",
-                           "cloudshell:GetEnvironmentStatus",
-                           "cloudshell:CreateSession",
-                           "cloudshell:StartEnvironment",
-                           "cloudshell:StopEnvironment",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id   = "ANPAQQWOSJEPRL2DTHOJL" -> null
-       tags        = {} -> null
-       tags_all    = {} -> null
    }

  # module.aws_custom_policies.aws_iam_policy.custom_policy["IAMServicesSupervisor"] will be created
+   resource "aws_iam_policy" "custom_policy" {
+       arn         = (known after apply)
+       description = "Policy granting IAM services admins permissions to make changes to user accounts"
+       id          = (known after apply)
+       name        = "IAMServicesSupervisor"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "iam:CreateAccessKey",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:iam::*:user/*"
                    },
+                   {
+                       Action    = [
+                           "iam:UpdateLoginProfile",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "iam:ResourceTag/Access Level" = [
+                                   "1",
+                                   "2",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:iam::*:user/*"
                    },
+                   {
+                       Action   = [
+                           "cloudshell:CreateEnvironment",
+                           "cloudshell:GetEnvironmentStatus",
+                           "cloudshell:CreateSession",
+                           "cloudshell:StartEnvironment",
+                           "cloudshell:StopEnvironment",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.iam_services_admin_group.aws_iam_group_policy_attachment.group_policy_attachment["IAMServicesAdmin"] must be replaced
-/+ resource "aws_iam_group_policy_attachment" "group_policy_attachment" {
!~      id         = "***************************************************" -> (known after apply)
!~      policy_arn = "arn:aws:iam::035866691871:policy/IAMServicesAdmin" # forces replacement -> (known after apply) # forces replacement
#        (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #32](https://github.com/hackforla/devops-security/actions/runs/8091962269)